In [1]:
import pandas as pd
import numpy as np

# Data set location
dataset = 'Data/student.csv'

# Load data into dataframe
df = pd.read_csv(dataset, header=0)

In [2]:
# Find categorical data
df_categorical = df.select_dtypes(exclude=[np.number])
df_categorical

     Gender      Grade Employed
0      Male  1st Class      yes
1    Female  2nd Class       no
2      Male  1st Class       no
3    Female  2nd Class       no
4      Male  1st Class       no
..      ...        ...      ...
227  Female  1st Class       no
228    Male  2nd Class       no
229    Male  3rd Class      yes
230  Female  1st Class      yes
231    Male  3rd Class      yes

[232 rows x 3 columns]

In [3]:
# Find the unique values in Grade
df_categorical['Grade'].unique()

array(['1st Class', '2nd Class', '3rd Class'], dtype=object)

In [4]:
# Find the frequency of each category
df_categorical.Grade.value_counts()

2nd Class    80
3rd Class    80
1st Class    72
Name: Grade, dtype: int64

In [5]:
# Gender
df_categorical.Gender.value_counts()

Male      136
Female     96
Name: Gender, dtype: int64

In [6]:
# Employed
df_categorical.Employed.value_counts()

no     133
yes     99
Name: Employed, dtype: int64

In [7]:
# Encode Grade
df_categorical.Grade.replace({'1st Class':1, 
                              '2nd Class':2, 
                              '3rd Class':3}, inplace=True)

In [8]:
# Encode Gender
df_categorical.Gender.replace({'Male':0, 
                               'Female':1}, inplace=True)

In [9]:
# Encode Employed
df_categorical.Employed.replace({'yes':1, 
                                 'no':0}, inplace=True)

In [10]:
df_categorical.head()

   Gender  Grade  Employed
0       0      1         1
1       1      2         0
2       0      1         0
3       1      2         0
4       0      1         0